var lunarhash={
    1:"初一",
    2:"初二",
    3:"初三",
    4:"初四",
    5:"初五",
    6:"初六",
    7:"初七",
    8:"初八",
    9:"初九",
    10:"初十",
    11:"十一",
    12:"十二",
    13:"十三",
    14:"十四",
    15:"十五",
    16:"十六",
    17:"十七",
    18:"十八",
    19:"十九",
    20:"二十",
    21:"廿一",
    22:"廿二",
    23:"廿三",
    24:"廿四",
    25:"廿五",
    26:"廿六",
    27:"廿七",
    28:"廿八",
    29:"廿九",
    30:"三十"
}
//公式如下天干：年份÷10,得到的商不管,看余数,得数即为天干顺序数-3
// 地支：年份÷12,得到的商不管,看余数,得数即为地支顺序数-3
// 十天干对应顺序：1甲2乙3丙4丁5戊6己7庚8辛9壬10癸
// 十二地支对应顺序：1子2丑3寅4卯5辰6巳7午8未9申10酉11戌12亥
var tiangan=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
var dizhi=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
var shengxiao={
    "子":"鼠",
    "丑":"牛",
    "寅":"虎",
    "卯":"兔",
    "辰":"龙",
    "巳":"蛇",
    "午":"马",
    "未":"羊",
    "申":"猴",
    "酉":"鸡",
    "戌":"狗",
    "亥":"猪"
}
var monthhash={
    1:"正月",
    2:"二月",
    3:"三月",
    4:"四月",
    5:"五月",
    6:"六月",
    7:"七月",
    8:"八月",
    9:"九月",
    10:"十月",
    11:"冬月",
    12:"腊月"
}
function  getYearName(year){
    var t=year%10-4;
    var ts=t>=0? tiangan[t]:tiangan[10+t];
    var d=year%12-4;
    var ds=d>=0? dizhi[d]:dizhi[12+d];
    return ts+ds+"("+shengxiao[ds]+")";

}

function getfestival(year,month,date){
    var hash={
        "101":"国庆节"
        //有时间写

    }
}